# GetTexBitPaintNode

## Description
Function GetTexBitPaintNode returns the paint node of the referenced texture bitmap.

```pascal
FUNCTION GetTexBitPaintNode(textureBitmap : HANDLE) : HANDLE;
```

```python

def vs.GetTexBitPaintNode(textureBitmap):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|textureBitmap|HANDLE|Handle to texture bitmap.|

## Remarks
Returns the paint node that contains the texture bitmap's image bits

## Version
```diff
- GetTexBitPaintNode is obsolete as of VectorWorks12.0
```

Availability: from VectorWorks8.0
## Category
* Textures